<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# Converting between data types
© ExploreAI Academy

In this notebook, we will learn how to convert one data type to another using the `CAST()` function.

> ⚠️ This notebook will not run on Google Colab because it cannot connect to a local database. Please make sure that this notebook is running on the same local machine as your MySQL Workbench installation and MySQL `united_nations` database.

## Learning objectives

In this train, we will learn:
- How to convert from one data type to another using the `CAST()` function.

## Overview

All the columns in our database have been assigned a data type during the creation of the database schema. When we query our data using the `SELECT` statement, the retrieved data will be returned in the same data type as specified in the schema.

Suppose we want to retrieve the data in a different data type, we can use the `CAST` function, which allows us to change from one data type to another.

## Connecting to our MySQL database

We will use our `Access_to_Basic_Services` table in our `united_nations` database that we created in MySQL Workbench. We can apply the same queries we used in MySQL Workbench in this notebook if we connect to our MySQL server by running the cells below.

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

In [2]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql mysql+pymysql://root:password@localhost:3306/united_nations

## Exercise


We can use the following command to check the data types of all the columns in our table.

In [3]:
%%sql

SHOW 
    COLUMNS
FROM 
    united_nations.Access_to_Basic_Services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[('Region', 'varchar(32)', 'YES', '', None, ''),
 ('Sub_region', 'varchar(25)', 'YES', '', None, ''),
 ('Country_name', 'varchar(37)', 'NO', '', None, ''),
 ('Time_period', 'int', 'NO', '', None, ''),
 ('Pct_managed_drinking_water_services', 'decimal(5,2)', 'YES', '', None, ''),
 ('Pct_managed_sanitation_services', 'decimal(5,2)', 'YES', '', None, ''),
 ('Est_population_in_millions', 'decimal(11,6)', 'YES', '', None, ''),
 ('Est_gdp_in_billions', 'decimal(8,2)', 'YES', '', None, ''),
 ('Land_area', 'decimal(10,2)', 'YES', '', None, ''),
 ('Pct_unemployment', 'decimal(5,2)', 'YES', '', None, '')]

We can see that the column values are in their respective data types, that is, `VARCHAR` for Country_name, `INT` for Time_period, and `DECIMAL` for the estimated population.

Let us type in the following query which will give us the estimated population for each distinct country, per year.

In [5]:
%%sql

SELECT DISTINCT
    Country_name, 
    Time_period, 
    Est_population_in_millions
FROM 
    united_nations.Access_to_Basic_Services
LIMIT 10

 * mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[('Kazakhstan', 2015, Decimal('17.542806')),
 ('Kazakhstan', 2016, Decimal('17.794055')),
 ('Kazakhstan', 2017, Decimal('18.037776')),
 ('Kazakhstan', 2018, Decimal('18.276452')),
 ('Kazakhstan', 2019, Decimal('18.513673')),
 ('Kazakhstan', 2020, Decimal('18.755666')),
 ('Kyrgyzstan', 2015, None),
 ('Kyrgyzstan', 2016, None),
 ('Kyrgyzstan', 2017, None),
 ('Kyrgyzstan', 2018, None)]

### 1. Determine the appropriate precision

Looking at `Est_population_in_millions`, it has been given the `DECIMAL(11,6)` numeric data type, which has a **precision of 11** and a **scale of 6**. This means that the number can have a total of 11 digits, with 6 digits allowed after the decimal point.

This makes the values too long and hard to read. 

Instead, we can alter its data type such that it is retrieved with **only 2 decimal values** to improve readability and efficiency.

We know we want to give a scale of 2, but what about the precision?
We can find the maximum value in the estimated population column, which we can then use to help us determine the most appropriate precision for the column.

In [6]:
%%sql

SELECT DISTINCT
    MAX(Est_population_in_millions)
FROM 
    united_nations.Access_to_Basic_Services

 * mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(Decimal('1411.100000'),)]

### 2. Convert to the DECIMAL data type with the preferred scale and precision

Once we have determined the appropriate precision to give to the `Est_population_in_millions` column values, we can then convert to the preferred data type.

In [8]:
%%sql

SELECT DISTINCT
    Country_name, 
    Time_period, 
    CAST(Est_population_in_millions AS Decimal(6,2))
FROM 
    united_nations.Access_to_Basic_Services
LIMIT 10

 * mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[('Kazakhstan', 2015, Decimal('17.54')),
 ('Kazakhstan', 2016, Decimal('17.79')),
 ('Kazakhstan', 2017, Decimal('18.04')),
 ('Kazakhstan', 2018, Decimal('18.28')),
 ('Kazakhstan', 2019, Decimal('18.51')),
 ('Kazakhstan', 2020, Decimal('18.76')),
 ('Kyrgyzstan', 2015, None),
 ('Kyrgyzstan', 2016, None),
 ('Kyrgyzstan', 2017, None),
 ('Kyrgyzstan', 2018, None)]

## Solutions

### 1. Determine the appropriate precision
We use the `MAX` function to help us find the maximum value in the `Est_population_in_millions` column.

In [ ]:
%%sql

SELECT DISTINCT
    MAX(Est_population_in_millions) 
FROM 
    united_nations.Access_to_Basic_Services;

Since the highest value in the column has 4 digits before the decimal point, we can safely assign a precision of 6, with a scale of 2 to the column.

### 2.  Convert to the DECIMAL data type with the preferred scale and precision

We use the `CAST` function to convert the `Estimated population in millions` column to the new data type and the results are returned in a new column, `Est_population_in_millions_2dp`.

In [ ]:
%%sql

SELECT DISTINCT
    Country_name, 
    Time_period, 
    CAST(Est_population_in_millions AS DECIMAL(6,2)) AS Est_population_in_millions_2dp
FROM 
    united_nations.Access_to_Basic_Services;

## Summary

We have successfully performed the conversion and our values now have only two decimal places.

**NOTE:** The `CAST()` function will only change the data type of the expression in the results set. It does not alter the actual data type specified in the database schema.

To permanently change the data type of a column, the `ALTER TABLE` statement is used.

#  

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>